src/DataProcessors/ЗаполнениеТестовыхДанных/ЗаполнениеТестовыхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеТестовыхДанных</name>
</mdclass:DataProcessor>

src/Documents/ПоступлениеКниг/ПоступлениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКниг</name>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <registerRecords>AccumulationRegister.ФондКниг</registerRecords>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЭкземпляра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыдачаКниги/ВыдачаКниги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаКниги</name>
  <attributes>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </attributes>
  <attributes>
    <name>Библиотекарь</name>
    <type><types>CatalogRef.Сотрудники</types></type>
  </attributes>
  <attributes>
    <name>ДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
  <registerRecords>AccumulationRegister.КнигиНаРуках</registerRecords>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type><types>CatalogRef.Книги</types></type>
    </attributes>
    <attributes>
      <name>КодЭкземпляра</name>
      <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/КатегорииЧитателей/КатегорииЧитателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииЧитателей</name>
  <attributes>
    <name>МаксКнигНаРуках</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксСрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Книги/Книги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Книги</name>
  <attributes>
    <name>ISBN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </attributes>
  <attributes>
    <name>Издательство</name>
    <type>
      <types>CatalogRef.Издательства</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодИздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Авторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Читатели/Читатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Читатели</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПрописки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЧитателей</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ЗаполнениеТестовыхДанных/ObjectModule.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Заполняет все тестовые данные и возвращает отчёт
//
// Возвращаемое значение:
//   Строка - краткий отчёт о заполнении
Функция ЗаполнитьВсе() Экспорт

	Лог = Новый Массив;

	// Справочники — порядок важен: сначала родительские
	ЗаполнитьКатегорииЧитателей(Лог);
	ЗаполнитьЖанры(Лог);
	ЗаполнитьАвторов(Лог);
	ЗаполнитьИздательства(Лог);
	ЗаполнитьМестаХранения(Лог);
	ЗаполнитьКниги(Лог);
	ЗаполнитьСотрудников(Лог);
	ЗаполнитьЧитателей(Лог);

	// Документы
	ЗаполнитьПоступленияКниг(Лог);
	ЗаполнитьВыдачиКниг(Лог);

	Возврат СтрСоединить(Лог, Символы.ПС);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ---------- Справочники ----------

Процедура ЗаполнитьКатегорииЧитателей(Лог)

	Данные = Новый Массив;

	ЭлДанные = Новый Структура("Наименование, МаксКнигНаРуках, МаксСрокДней");
	ЭлДанные.Наименование      = "Школьник";
	ЭлДанные.МаксКнигНаРуках   = 3;
	ЭлДанные.МаксСрокДней      = 14;
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, МаксКнигНаРуках, МаксСрокДней");
	ЭлДанные.Наименование      = "Студент";
	ЭлДанные.МаксКнигНаРуках   = 5;
	ЭлДанные.МаксСрокДней      = 30;
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, МаксКнигНаРуках, МаксСрокДней");
	ЭлДанные.Наименование      = "Взрослый";
	ЭлДанные.МаксКнигНаРуках   = 10;
	ЭлДанные.МаксСрокДней      = 30;
	Данные.Добавить(ЭлДанные);

	Счётчик = 0;
	Для Каждого Эл Из Данные Цикл
		Если НайтиВСправочнике("КатегорииЧитателей", Эл.Наименование) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.КатегорииЧитателей.СоздатьЭлемент();
		Объект.Наименование      = Эл.Наименование;
		Объект.МаксКнигНаРуках   = Эл.МаксКнигНаРуках;
		Объект.МаксСрокДней      = Эл.МаксСрокДней;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("КатегорииЧитателей: добавлено " + Счётчик + " из " + Данные.Количество());

КонецПроцедуры

Процедура ЗаполнитьЖанры(Лог)

	Наименования = СтрРазделить("Роман,Детектив,Фантастика,Поэзия,Научная литература,Исторический роман,Приключения,Детская литература", ",");
	Счётчик = 0;

	Для Каждого Назв Из Наименования Цикл
		Если НайтиВСправочнике("Жанры", Назв) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.Жанры.СоздатьЭлемент();
		Объект.Наименование = Назв;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("Жанры: добавлено " + Счётчик + " из " + Наименования.Количество());

КонецПроцедуры

Процедура ЗаполнитьАвторов(Лог)

	Данные = Новый Массив;

	ЭлДанные = Новый Структура("Наименование, ДатаРождения");
	ЭлДанные.Наименование  = "Толстой Лев Николаевич";
	ЭлДанные.ДатаРождения  = '18280828';
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, ДатаРождения");
	ЭлДанные.Наименование  = "Достоевский Фёдор Михайлович";
	ЭлДанные.ДатаРождения  = '18211111';
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, ДатаРождения");
	ЭлДанные.Наименование  = "Чехов Антон Павлович";
	ЭлДанные.ДатаРождения  = '18600117';
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, ДатаРождения");
	ЭлДанные.Наименование  = "Пушкин Александр Сергеевич";
	ЭлДанные.ДатаРождения  = '17990606';
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, ДатаРождения");
	ЭлДанные.Наименование  = "Булгаков Михаил Афанасьевич";
	ЭлДанные.ДатаРождения  = '18910515';
	Данные.Добавить(ЭлДанные);

	ЭлДанные = Новый Структура("Наименование, ДатаРождения");
	ЭлДанные.Наименование  = "Гоголь Николай Васильевич";
	ЭлДанные.ДатаРождения  = '18090401';
	Данные.Добавить(ЭлДанные);

	Счётчик = 0;
	Для Каждого Эл Из Данные Цикл
		Если НайтиВСправочнике("Авторы", Эл.Наименование) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.Авторы.СоздатьЭлемент();
		Объект.Наименование = Эл.Наименование;
		Объект.ДатаРождения = Эл.ДатаРождения;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("Авторы: добавлено " + Счётчик + " из " + Данные.Количество());

КонецПроцедуры

Процедура ЗаполнитьИздательства(Лог)

	Наименования = СтрРазделить("Эксмо,АСТ,Питер,Просвещение,МИФ", ",");
	Счётчик = 0;

	Для Каждого Назв Из Наименования Цикл
		Если НайтиВСправочнике("Издательства", Назв) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.Издательства.СоздатьЭлемент();
		Объект.Наименование = Назв;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("Издательства: добавлено " + Счётчик + " из " + Наименования.Количество());

КонецПроцедуры

Процедура ЗаполнитьМестаХранения(Лог)

	Наименования = СтрРазделить("Зал 1 (Художественная литература),Зал 2 (Научная литература),Читальный зал", ",");
	Счётчик = 0;

	Для Каждого Назв Из Наименования Цикл
		Если НайтиВСправочнике("МестаХранения", Назв) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.МестаХранения.СоздатьЭлемент();
		Объект.Наименование = Назв;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("МестаХранения: добавлено " + Счётчик + " из " + Наименования.Количество());

КонецПроцедуры

Процедура ЗаполнитьКниги(Лог)

	АвторТолстой      = НайтиВСправочнике("Авторы", "Толстой Лев Николаевич");
	АвторДостоевский  = НайтиВСправочнике("Авторы", "Достоевский Фёдор Михайлович");
	АвторЧехов        = НайтиВСправочнике("Авторы", "Чехов Антон Павлович");
	АвторПушкин       = НайтиВСправочнике("Авторы", "Пушкин Александр Сергеевич");
	АвторБулгаков     = НайтиВСправочнике("Авторы", "Булгаков Михаил Афанасьевич");
	АвторГоголь       = НайтиВСправочнике("Авторы", "Гоголь Николай Васильевич");

	ЖанрРоман         = НайтиВСправочнике("Жанры", "Роман");
	ЖанрДетектив      = НайтиВСправочнике("Жанры", "Детектив");
	ЖанрПоэзия        = НайтиВСправочнике("Жанры", "Поэзия");
	ЖанрИстория       = НайтиВСправочнике("Жанры", "Исторический роман");

	ИздЭксмо          = НайтиВСправочнике("Издательства", "Эксмо");
	ИздАСТ            = НайтиВСправочнике("Издательства", "АСТ");

	Данные = Новый Массив;

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Война и мир";
	Кн.ISBN          = "978-5-699-20879-9";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2010;
	Кн.Описание      = "Эпический роман о войне 1812 года и судьбах русских семей.";
	Кн.Автор         = АвторТолстой;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Преступление и наказание";
	Кн.ISBN          = "978-5-699-18024-7";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2009;
	Кн.Описание      = "Психологический роман о студенте, совершившем убийство.";
	Кн.Автор         = АвторДостоевский;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Вишнёвый сад";
	Кн.ISBN          = "978-5-389-06412-3";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздАСТ;
	Кн.ГодИздания    = 2015;
	Кн.Описание      = "Пьеса о судьбе дворянской усадьбы.";
	Кн.Автор         = АвторЧехов;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Евгений Онегин";
	Кн.ISBN          = "978-5-699-53715-1";
	Кн.Жанр          = ЖанрПоэзия;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2011;
	Кн.Описание      = "Роман в стихах — энциклопедия русской жизни.";
	Кн.Автор         = АвторПушкин;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Мастер и Маргарита";
	Кн.ISBN          = "978-5-699-06495-5";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2008;
	Кн.Описание      = "Мистический роман о дьяволе, посетившем Москву.";
	Кн.Автор         = АвторБулгаков;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Мёртвые души";
	Кн.ISBN          = "978-5-699-38767-6";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2012;
	Кн.Описание      = "Поэма о путешествии Чичикова и его махинациях.";
	Кн.Автор         = АвторГоголь;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Анна Каренина";
	Кн.ISBN          = "978-5-699-20882-9";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2013;
	Кн.Описание      = "Роман о трагической судьбе замужней женщины.";
	Кн.Автор         = АвторТолстой;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Идиот";
	Кн.ISBN          = "978-5-699-18031-5";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздЭксмо;
	Кн.ГодИздания    = 2014;
	Кн.Описание      = "Роман о человеке с чистой душой в жестоком мире.";
	Кн.Автор         = АвторДостоевский;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Три сестры";
	Кн.ISBN          = "978-5-389-06413-0";
	Кн.Жанр          = ЖанрРоман;
	Кн.Издательство  = ИздАСТ;
	Кн.ГодИздания    = 2016;
	Кн.Описание      = "Пьеса о жизни трёх сестёр провинциального города.";
	Кн.Автор         = АвторЧехов;
	Данные.Добавить(Кн);

	Кн = Новый Структура("Наименование, ISBN, Жанр, Издательство, ГодИздания, Описание, Автор");
	Кн.Наименование  = "Ревизор";
	Кн.ISBN          = "978-5-699-38768-3";
	Кн.Жанр          = ЖанрИстория;
	Кн.Издательство  = ИздАСТ;
	Кн.ГодИздания    = 2017;
	Кн.Описание      = "Комедия о приезде мнимого ревизора в уездный город.";
	Кн.Автор         = АвторГоголь;
	Данные.Добавить(Кн);

	Счётчик = 0;
	Для Каждого Эл Из Данные Цикл
		Если НайтиВСправочнике("Книги", Эл.Наименование) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.Книги.СоздатьЭлемент();
		Объект.Наименование = Эл.Наименование;
		Объект.ISBN         = Эл.ISBN;
		Объект.Жанр         = Эл.Жанр;
		Объект.Издательство = Эл.Издательство;
		Объект.ГодИздания   = Эл.ГодИздания;
		Объект.Описание     = Эл.Описание;

		Если Эл.Автор <> Неопределено Тогда
			СтрАвтор = Объект.Авторы.Добавить();
			СтрАвтор.Автор = Эл.Автор;
			СтрАвтор.Роль  = "Автор";
		КонецЕсли;

		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("Книги: добавлено " + Счётчик + " из " + Данные.Количество());

КонецПроцедуры

Процедура ЗаполнитьСотрудников(Лог)

	Данные = Новый Массив;

	Сотр = Новый Структура("Наименование, Должность");
	Сотр.Наименование = "Иванова Елена Петровна";
	Сотр.Должность    = "Библиотекарь";
	Данные.Добавить(Сотр);

	Сотр = Новый Структура("Наименование, Должность");
	Сотр.Наименование = "Петров Игорь Владимирович";
	Сотр.Должность    = "Старший библиотекарь";
	Данные.Добавить(Сотр);

	Счётчик = 0;
	Для Каждого Эл Из Данные Цикл
		Если НайтиВСправочнике("Сотрудники", Эл.Наименование) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.Сотрудники.СоздатьЭлемент();
		Объект.Наименование = Эл.Наименование;
		Объект.Должность    = Эл.Должность;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("Сотрудники: добавлено " + Счётчик + " из " + Данные.Количество());

КонецПроцедуры

Процедура ЗаполнитьЧитателей(Лог)

	КатШкольник  = НайтиВСправочнике("КатегорииЧитателей", "Школьник");
	КатСтудент   = НайтиВСправочнике("КатегорииЧитателей", "Студент");
	КатВзрослый  = НайтиВСправочнике("КатегорииЧитателей", "Взрослый");

	Данные = Новый Массив;

	Чит = Новый Структура("Наименование, ДатаРождения, Телефон, Email, АдресПрописки, НомерБилета, ДатаРегистрации, Категория");
	Чит.Наименование      = "Смирнов Алексей Игоревич";
	Чит.ДатаРождения      = '20050315';
	Чит.Телефон           = "+7-900-111-22-33";
	Чит.Email             = "smirnov@mail.ru";
	Чит.АдресПрописки     = "г. Москва, ул. Ленина, д.5, кв.10";
	Чит.НомерБилета       = "БИЛ-001";
	Чит.ДатаРегистрации   = '20230901';
	Чит.Категория         = КатШкольник;
	Данные.Добавить(Чит);

	Чит = Новый Структура("Наименование, ДатаРождения, Телефон, Email, АдресПрописки, НомерБилета, ДатаРегистрации, Категория");
	Чит.Наименование      = "Козлова Мария Дмитриевна";
	Чит.ДатаРождения      = '20031122';
	Чит.Телефон           = "+7-900-222-33-44";
	Чит.Email             = "kozlova@mail.ru";
	Чит.АдресПрописки     = "г. Москва, ул. Мира, д.12, кв.5";
	Чит.НомерБилета       = "БИЛ-002";
	Чит.ДатаРегистрации   = '20230901';
	Чит.Категория         = КатСтудент;
	Данные.Добавить(Чит);

	Чит = Новый Структура("Наименование, ДатаРождения, Телефон, Email, АдресПрописки, НомерБилета, ДатаРегистрации, Категория");
	Чит.Наименование      = "Новиков Дмитрий Александрович";
	Чит.ДатаРождения      = '20010708';
	Чит.Телефон           = "+7-900-333-44-55";
	Чит.Email             = "novikov@gmail.com";
	Чит.АдресПрописки     = "г. Москва, Садовая ул., д.3, кв.22";
	Чит.НомерБилета       = "БИЛ-003";
	Чит.ДатаРегистрации   = '20231015';
	Чит.Категория         = КатСтудент;
	Данные.Добавить(Чит);

	Чит = Новый Структура("Наименование, ДатаРождения, Телефон, Email, АдресПрописки, НомерБилета, ДатаРегистрации, Категория");
	Чит.Наименование      = "Федорова Ольга Сергеевна";
	Чит.ДатаРождения      = '19851203';
	Чит.Телефон           = "+7-900-444-55-66";
	Чит.Email             = "fedorova@yandex.ru";
	Чит.АдресПрописки     = "г. Москва, Комсомольская ул., д.8, кв.15";
	Чит.НомерБилета       = "БИЛ-004";
	Чит.ДатаРегистрации   = '20240201';
	Чит.Категория         = КатВзрослый;
	Данные.Добавить(Чит);

	Чит = Новый Структура("Наименование, ДатаРождения, Телефон, Email, АдресПрописки, НомерБилета, ДатаРегистрации, Категория");
	Чит.Наименование      = "Морозов Виктор Николаевич";
	Чит.ДатаРождения      = '19781025';
	Чит.Телефон           = "+7-900-555-66-77";
	Чит.Email             = "morozov@mail.ru";
	Чит.АдресПрописки     = "г. Москва, Первомайская ул., д.20, кв.7";
	Чит.НомерБилета       = "БИЛ-005";
	Чит.ДатаРегистрации   = '20240315';
	Чит.Категория         = КатВзрослый;
	Данные.Добавить(Чит);

	Счётчик = 0;
	Для Каждого Эл Из Данные Цикл
		Если НайтиВСправочнике("Читатели", Эл.Наименование) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Объект = Справочники.Читатели.СоздатьЭлемент();
		Объект.Наименование    = Эл.Наименование;
		Объект.ДатаРождения    = Эл.ДатаРождения;
		Объект.Телефон         = Эл.Телефон;
		Объект.Email           = Эл.Email;
		Объект.АдресПрописки   = Эл.АдресПрописки;
		Объект.НомерБилета     = Эл.НомерБилета;
		Объект.ДатаРегистрации = Эл.ДатаРегистрации;
		Объект.Категория       = Эл.Категория;
		Объект.Записать();
		Счётчик = Счётчик + 1;
	КонецЦикла;

	Лог.Добавить("Читатели: добавлено " + Счётчик + " из " + Данные.Количество());

КонецПроцедуры

// ---------- Документы ----------

Процедура ЗаполнитьПоступленияКниг(Лог)

	МестоЗал1 = НайтиВСправочнике("МестаХранения", "Зал 1 (Художественная литература)");
	МестоЗал2 = НайтиВСправочнике("МестаХранения", "Зал 2 (Научная литература)");

	КнигиЗал1 = Новый Массив;
	КнигиЗал1.Добавить("Война и мир");
	КнигиЗал1.Добавить("Преступление и наказание");
	КнигиЗал1.Добавить("Вишнёвый сад");
	КнигиЗал1.Добавить("Мастер и Маргарита");
	КнигиЗал1.Добавить("Мёртвые души");

	КнигиЗал2 = Новый Массив;
	КнигиЗал2.Добавить("Евгений Онегин");
	КнигиЗал2.Добавить("Анна Каренина");
	КнигиЗал2.Добавить("Идиот");
	КнигиЗал2.Добавить("Три сестры");
	КнигиЗал2.Добавить("Ревизор");

	Счётчик = 0;
	Счётчик = Счётчик + СоздатьДокументПоступления('20240101', МестоЗал1, КнигиЗал1, "П1");
	Счётчик = Счётчик + СоздатьДокументПоступления('20240115', МестоЗал2, КнигиЗал2, "П2");

	Лог.Добавить("ПоступлениеКниг: создано " + Счётчик + " документа(ов)");

КонецПроцедуры

Функция СоздатьДокументПоступления(Дата, МестоХранения, МассивКниг, ПрефКод)

	Если МестоХранения = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Документ = Документы.ПоступлениеКниг.СоздатьДокумент();
	Документ.Дата          = Дата;
	Документ.МестоХранения = МестоХранения;

	НомерКниги = 1;
	Для Каждого НазвКниги Из МассивКниг Цикл
		КнигаСсылка = НайтиВСправочнике("Книги", НазвКниги);
		Если КнигаСсылка = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		// Добавляем 3 экземпляра каждой книги
		Для НомЭкз = 1 По 3 Цикл
			Строка = Документ.Книги.Добавить();
			Строка.Книга         = КнигаСсылка;
			Строка.КодЭкземпляра = ПрефКод + "-" + Формат(НомерКниги, "ЧЦ=2; ЧВН=; ЧГ=0") + "-" + НомЭкз;
			Строка.Количество    = 1;
			Строка.Цена          = 500;
			Строка.Состояние     = "Хорошее";
		КонецЦикла;
		НомерКниги = НомерКниги + 1;
	КонецЦикла;

	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Возврат 1;

КонецФункции

Процедура ЗаполнитьВыдачиКниг(Лог)

	Библиотекарь = НайтиВСправочнике("Сотрудники", "Иванова Елена Петровна");

	Данные = Новый Массив;

	Выд = Новый Структура("Дата, Читатель, ДатаВозврата, Книга, КодЭкземпляра");
	Выд.Дата           = '20240201';
	Выд.Читатель       = НайтиВСправочнике("Читатели", "Смирнов Алексей Игоревич");
	Выд.ДатаВозврата   = '20240215';
	Выд.Книга          = НайтиВСправочнике("Книги", "Война и мир");
	Выд.КодЭкземпляра  = "П1-01-1";
	Данные.Добавить(Выд);

	Выд = Новый Структура("Дата, Читатель, ДатаВозврата, Книга, КодЭкземпляра");
	Выд.Дата           = '20240205';
	Выд.Читатель       = НайтиВСправочнике("Читатели", "Козлова Мария Дмитриевна");
	Выд.ДатаВозврата   = '20240305';
	Выд.Книга          = НайтиВСправочнике("Книги", "Мастер и Маргарита");
	Выд.КодЭкземпляра  = "П1-04-1";
	Данные.Добавить(Выд);

	Выд = Новый Структура("Дата, Читатель, ДатаВозврата, Книга, КодЭкземпляра");
	Выд.Дата           = '20240210';
	Выд.Читатель       = НайтиВСправочнике("Читатели", "Новиков Дмитрий Александрович");
	Выд.ДатаВозврата   = '20240310';
	Выд.Книга          = НайтиВСправочнике("Книги", "Евгений Онегин");
	Выд.КодЭкземпляра  = "П2-01-1";
	Данные.Добавить(Выд);

	Выд = Новый Структура("Дата, Читатель, ДатаВозврата, Книга, КодЭкземпляра");
	Выд.Дата           = '20240220';
	Выд.Читатель       = НайтиВСправочнике("Читатели", "Федорова Ольга Сергеевна");
	Выд.ДатаВозврата   = '20240320';
	Выд.Книга          = НайтиВСправочнике("Книги", "Анна Каренина");
	Выд.КодЭкземпляра  = "П2-02-1";
	Данные.Добавить(Выд);

	Выд = Новый Структура("Дата, Читатель, ДатаВозврата, Книга, КодЭкземпляра");
	Выд.Дата           = '20240301';
	Выд.Читатель       = НайтиВСправочнике("Читатели", "Морозов Виктор Николаевич");
	Выд.ДатаВозврата   = '20240401';
	Выд.Книга          = НайтиВСправочнике("Книги", "Преступление и наказание");
	Выд.КодЭкземпляра  = "П1-02-1";
	Данные.Добавить(Выд);

	Счётчик = 0;
	Для Каждого Эл Из Данные Цикл
		Если Эл.Читатель = Неопределено Или Эл.Книга = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Документ = Документы.ВыдачаКниги.СоздатьДокумент();
		Документ.Дата          = Эл.Дата;
		Документ.Читатель      = Эл.Читатель;
		Документ.Библиотекарь  = Библиотекарь;
		Документ.ДатаВозврата  = Эл.ДатаВозврата;

		Строка = Документ.Книги.Добавить();
		Строка.Книга         = Эл.Книга;
		Строка.КодЭкземпляра = Эл.КодЭкземпляра;

		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			Счётчик = Счётчик + 1;
		Исключение
			// Книга могла не попасть в фонд — пропускаем
		КонецПопытки;
	КонецЦикла;

	Лог.Добавить("ВыдачаКниги: создано " + Счётчик + " из " + Данные.Количество() + " документа(ов)");

КонецПроцедуры

// ---------- Вспомогательные ----------

// Ищет элемент справочника по наименованию, возвращает ссылку или Неопределено
//
// Параметры:
//   ИмяСправочника - Строка - имя метаданного справочника
//   Наименование   - Строка - искомое наименование
//
// Возвращаемое значение:
//   СправочникСсылка - найденная ссылка или Неопределено
Функция НайтиВСправочнике(ИмяСправочника, Наименование)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сп.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК Сп
	|ГДЕ
	|	Сп.Наименование = &Наименование
	|	И НЕ Сп.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Рез = Запрос.Выполнить().Выгрузить();

	Если Рез.Количество() > 0 Тогда
		Возврат Рез[0].Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти
